# Является ли палиндромом?
# Напишите функцию, проверяющую является ли число палиндромом.
# палиндром - число одинаково читающееся слева направо, так и справа налево.
#  Пример палиндрома: 12321

def palindrome(number):
    pass
def palindrome(number):

n_str=str(number)
return str(number) == str(number)[::-1]
print(palindrome(121))
print(palindrome(666))
print(palindrome(1771))
print(palindrome(121))
