# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -100 до 100.
# Вывести на экран сумму всех положительных элементов кратных двум.

# TODO: your code here
my_list=(8,6,10,98)
if el%2 == 0 and el>0 :
    summa=summa+el
    print(summa)
